ut/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АУ_СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ut/src/CommonModules/АУ_ОбщиеПроцедурыИФункцииСервер/Module.bsl
Функция ВидКИПартнераПоВидуКИКонтрагента(ВидКИКонтрагента, ИспользоватьПартнеровКакКонтрагентов) Экспорт
	ВидКиПартнера = Неопределено;
	
	Если ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
	ИначеЕсли ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
	ИначеЕсли ВидКИКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
		ВидКиПартнера = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
	ИначеЕсли ЗначениеЗаполнено(ВидКИКонтрагента) И ИспользоватьПартнеровКакКонтрагентов Тогда
		Если Не (ОбщегоНазначения.СсылкаСуществует(ВидКИКонтрагента)
			И ТипЗнч(ВидКИКонтрагента) = Тип("СправочникСсылка.ВидыКонтактнойИнформации")) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Поиск или создание прочих видов КИ.
		ЗначенияРеквизитовВидаКИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидКИКонтрагента, "Тип, Наименование"); // Структура
		
		ВидКИПартнера = ВидПользовательскойКонтактнойИнформации(ЗначенияРеквизитовВидаКИ.Наименование,
			Справочники.ВидыКонтактнойИнформации.СправочникПартнеры,
			ЗначенияРеквизитовВидаКИ.Тип);
		
	КонецЕсли;
	
	Возврат ВидКИПартнера;
КонецФункции

Функция ВидПользовательскойКонтактнойИнформации(НаименованиеКИ, ГруппаВидовКИ, ТипКИ)
	ТекВидКИ = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Ссылка В ИЕРАРХИИ(&ГруппаВидовКИ)
	|	И ВидыКонтактнойИнформации.Наименование = &Наименование
	|	И ВидыКонтактнойИнформации.Тип = &ТипКИ
	|	И ВидыКонтактнойИнформации.Используется = ИСТИНА
	|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ");
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
	Запрос.УстановитьПараметр("Наименование",  НаименованиеКИ);
	Запрос.УстановитьПараметр("ТипКИ",         ТипКИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекВидКИ = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекВидКИ) Тогда
		ТекВидКИ = НовыйВидКонтактнойИнформации(НаименованиеКИ, ГруппаВидовКИ, ТипКИ);
	КонецЕсли;
	
	Возврат ТекВидКИ;
КонецФункции

Функция НовыйВидКонтактнойИнформации(Наименование, Родитель, ТипКИ)
	ВидКИОбъект = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
	ВидКИОбъект.Родитель     = Родитель;
	ВидКИОбъект.Наименование = Наименование;
	ВидКИОбъект.Тип          = ТипКИ;
	ВидКИОбъект.Используется = Истина;
	ВидКИОбъект.Записать();
	
	Возврат ВидКИОбъект.Ссылка;
КонецФункции

Функция ВыполнитьЗапрос(Менеджер,Текст) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Менеджер;
	Запрос.Текст=Текст;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура АУ_ПриобретениеТоваровПриПроведенеииФормированиеОповещенийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	АУ_ОповещенияОПоступленияхТоваров.ОповещениеСформировано КАК ОповещениеСформировано
	             |ИЗ
	             |	РегистрСведений.АУ_ОповещенияОПоступленияхТоваров КАК АУ_ОповещенияОПоступленияхТоваров
	             |ГДЕ
	             |	АУ_ОповещенияОПоступленияхТоваров.Поступление = &Поступление";
	Запрос.УстановитьПараметр("Поступление",Источник.Ссылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() ИЛИ Выборка.ОповещениеСформировано=NULL Тогда
		
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ПриобретениеТоваровУслугТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		             |	ДокЗаказПоставщику.Контрагент КАК Контрагент
		             |ПОМЕСТИТЬ ВТЗаказыПоставщикам
		             |ИЗ
		             |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |ГДЕ
		             |	ПриобретениеТоваровУслугТовары.Ссылка = &Поступление
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ПриобретениеТоваровУслуг.ЗаказПоставщику,
		             |	ДокЗаказПоставщику.Контрагент
		             |ИЗ
		             |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ПриобретениеТоваровУслуг.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |ГДЕ
		             |	ПриобретениеТоваровУслуг.Ссылка = &Поступление
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ЗаказПоставщикуТовары.АУ_ЗаказКлиента КАК АУ_ЗаказКлиента,
		             |	ЗаказКлиента.АУ_Программа КАК АУ_Программа,
		             |	ЗаказКлиента.Контрагент КАК Контрагент
		             |ПОМЕСТИТЬ ВТЗаказыКлиентов
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗаказКлиента.Ссылка)
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ЗаказКлиента.Ссылка,
		             |	ЗаказКлиента.АУ_Программа,
		             |	ЗаказКлиента.Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ДокЗаказПоставщику.ДокументОснование = ЗаказКлиента.Ссылка)
		             |ГДЕ
		             |	ДокЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	ЗаказКлиента.Ссылка,
		             |	ЗаказКлиента.АУ_Программа,
		             |	ЗаказКлиента.Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		             |		ПО ВТЗаказыПоставщикам.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказНаСборку
		             |		ПО (ДокЗаказПоставщику.ДокументОснование = ЗаказНаСборку.Ссылка)
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		             |		ПО (ЗаказНаСборку.ДокументОснование = ЗаказКлиента.Ссылка)
		             |ГДЕ
		             |	ДокЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказНаСборку
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	АУ_ПрограммыОтветственные.Ответственный КАК Ответственный
		             |ИЗ
		             |	Справочник.АУ_Программы.Ответственные КАК АУ_ПрограммыОтветственные
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыКлиентов КАК ВТЗаказыКлиентов
		             |		ПО АУ_ПрограммыОтветственные.Ссылка = ВТЗаказыКлиентов.АУ_Программа
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыПоставщикам.ЗаказПоставщику) КАК ЗаказПоставщику,
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыПоставщикам.Контрагент) КАК Контрагент
		             |ИЗ
		             |	ВТЗаказыПоставщикам КАК ВТЗаказыПоставщикам
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыКлиентов.АУ_ЗаказКлиента) КАК ЗаказКлиента,
		             |	ПРЕДСТАВЛЕНИЕ(ВТЗаказыКлиентов.Контрагент) КАК Контрагент
		             |ИЗ
		             |	ВТЗаказыКлиентов КАК ВТЗаказыКлиентов";
		
		Пакет=Запрос.ВыполнитьПакет();
		Выборка=Пакет[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Задача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			Задача.Дата=ТекущаяДата();
			Задача.Наименование=СтрШаблон("Ознакомиться с поступлением товаров: %1 %2",Источник.Контрагент,Источник.Ссылка);
			Задача.Автор=Пользователи.АвторизованныйПользователь();
			Задача.Исполнитель=Выборка.Ответственный;
			Задача.ДатаИсполнения=КонецДня(ТекущаяДата());
			Задача.ДатаНачала=НачалоДня(ТекущаяДата());
			Задача.Предмет=Источник.Ссылка;
			Задача.ПредметСтрокой=Источник.Ссылка;
			Задача.СрокИсполнения=КонецДня(ТекущаяДата());
			
			МассивЗП=Новый Массив;
			ВыборкаДок=Пакет[3].Выбрать();
			Пока ВыборкаДок.Следующий() Цикл
				МассивЗП.Добавить(СтрШаблон("%1 %2",ВыборкаДок.Контрагент,ВыборкаДок.ЗаказПоставщику));
			КонецЦикла;
			МассивЗК=Новый Массив;
			ВыборкаДок=Пакет[4].Выбрать();
			Пока ВыборкаДок.Следующий() Цикл
				МассивЗП.Добавить(СтрШаблон("%1 %2",ВыборкаДок.Контрагент,ВыборкаДок.ЗаказКлиента));
			КонецЦикла;
			
			Задача.Описание=СтрШаблон("Создано поступление товаров:
							|%1
							|по заказам поставщику
							|%2
							|по заказам клиентов
							|%3",Источник.Ссылка,СтрСоединить(МассивЗП,","),СтрСоединить(МассивЗК,","));
			Задача.Записать();
			
			Напоминание=РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
			Напоминание.Пользователь=Выборка.Ответственный;
			Напоминание.ВремяСобытия=ТекущаяДата();
			Напоминание.Источник=Задача.Ссылка;
			Напоминание.СрокНапоминания=ТекущаяДата();
			Напоминание.Описание=Задача.Описание;
			Напоминание.СпособУстановкиВремениНапоминания=Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
			Напоминание.ПредставлениеИсточника=Источник.Ссылка;
			Напоминание.Записать(Истина);
			
		КонецЦикла;
		
		рег=РегистрыСведений.АУ_ОповещенияОПоступленияхТоваров.СоздатьМенеджерЗаписи();
		рег.Поступление=Источник.Ссылка;
		рег.ОповещениеСформировано=Истина;
		рег.Записать(Истина);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьEmailКонтрагента(Контрагент) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	       |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	       |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	       |ИЗ
	       |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	       |ГДЕ
	       |	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
	       |	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	Запрос.УстановитьПараметр("Ссылка",Контрагент);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.АдресЭП),Выборка.АдресЭП,Выборка.Представление);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьEmailОбъекта(ТекОбъект) Экспорт
	
	Для каждого стрКонтакт Из ТекОбъект.КонтактнаяИнформация Цикл
		Если стрКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Возврат ?(ЗначениеЗаполнено(стрКонтакт.АдресЭП), стрКонтакт.АдресЭП, стрКонтакт.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция СоздатьЗадачуИсполнителю(Исполнитель, Наименование, Предмет) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	Задача.Дата = ТекущаяДатаСеанса();
	Задача.Исполнитель = Исполнитель;
	Задача.Наименование = Наименование;
	Задача.Предмет = Предмет;
	Задача.Автор = Пользователи.АвторизованныйПользователь();
	Задача.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	Задача.ПредметСтрокой = Предмет;
	Задача.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задача.Ссылка;
	
КонецФункции

Функция ПолучитьБлижайшуюРабочуюДату(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ДанныеПроизводственногоКалендаря.Дата) КАК Дата
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата >= &Дата
	|	И ДанныеПроизводственногоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))";
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

Функция ДобавитьКДатеРабочиеДни(ДатаСтарта, КоличествоДней)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
    |	ВЫБОР
    |		КОГДА Т.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
    |				ИЛИ Т.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
    |			ТОГДА 1
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ЧислоРабочихДней,
    |	Т.Дата КАК ДатаКалендаря
    |ПОМЕСТИТЬ ТЗ
    |ИЗ
    |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Т
    |ГДЕ
    |	Т.Дата МЕЖДУ &ДатаСтарта И &ДатаПредела
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТЗ.ДатаКалендаря КАК ДатаКалендаря,
    |	СУММА(ТЗ1.ЧислоРабочихДней) КАК ЧислоРабочихДней
    |ПОМЕСТИТЬ ТЗНакопл
    |ИЗ
    |	ТЗ КАК ТЗ
    |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ1
    |		ПО (ТЗ1.ДатаКалендаря <= ТЗ.ДатаКалендаря)
    |
    |СГРУППИРОВАТЬ ПО
    |	ТЗ.ДатаКалендаря
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МАКСИМУМ(ТЗ.ДатаКалендаря) КАК ДатаКалендаря
    |ИЗ
    |	ТЗНакопл КАК ТЗ
    |ГДЕ
    |	ТЗ.ЧислоРабочихДней = &ЧислоРабочихДней";
	
	Запрос.УстановитьПараметр("ДатаСтарта", НачалоДня(ДатаСтарта));
	Запрос.УстановитьПараметр("ДатаПредела", НачалоДня(ДатаСтарта) + 86400 * (КоличествоДней + 30));
	Запрос.УстановитьПараметр("ЧислоРабочихДней", КоличествоДней);
	
	Если КоличествоДней < 0 Тогда
		Запрос.УстановитьПараметр("ДатаПредела", НачалоДня(ДатаСтарта) + 86400 * (КоличествоДней - 30));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<", ">");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаСтарта И &ДатаПредела", "&ДатаПредела И &ДатаСтарта");
		Запрос.УстановитьПараметр("ЧислоРабочихДней", - КоличествоДней);
	КонецЕсли;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.ДатаКалендаря <> NULL Тогда
		Возврат Выборка.ДатаКалендаря;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТелефонКонтактногоЛица(Контакт) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Контакты.НомерТелефона КАК НомерТелефона,
	             |	Контакты.Представление КАК Представление
	             |ИЗ
	             |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Контакты
	             |ГДЕ
	             |	Контакты.Ссылка = &Ссылка
	             |	И Контакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	             |	И НЕ Контакты.НомерТелефона = """"";
	Запрос.УстановитьПараметр("Ссылка",Контакт);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Представление), Выборка.Представление, Выборка.НомерТелефона);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКлючевыеСтавки(ПериодНачало, ПериодОкончание) Экспорт
    
    КлючевыеСтавки = Новый ТаблицаЗначений;
    КлючевыеСтавки.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
    КлючевыеСтавки.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Любой)));
        
    СоединениеSSL     = Новый ЗащищенноеСоединениеOpenSSL();
    Определения         = Новый WSОпределения("https://www.cbr.ru/DailyInfoWebServ/DailyInfo.asmx?WSDL", , , , , СоединениеSSL);
    Прокси             = Новый WSПрокси(Определения,"http://web.cbr.ru/","DailyInfo","DailyInfoSoap", , , СоединениеSSL);    
    KeyRateXMLТип         = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("KeyRateXML");
    KeyRateXMLОбъект     = Прокси.ФабрикаXDTO.Создать(KeyRateXMLТип);
    KeyRateXMLОбъект.fromDate     = ПериодНачало;
    KeyRateXMLОбъект.ToDate         = ПериодОкончание;
    
    КлючевыеСтавкиОбъект = Прокси.KeyRateXML(KeyRateXMLОбъект);
    
    Для каждого rcdKR Из КлючевыеСтавкиОбъект.KeyRateXMLResult.KeyRate.KR Цикл
        стрКлючевыеСтавки = КлючевыеСтавки.Добавить();
        стрКлючевыеСтавки.Период     = XMLЗначение(Тип("Дата"), rcdKR.DT);
        стрКлючевыеСтавки.Значение     = XMLЗначение(Тип("Число"), rcdKR.Rate);
    КонецЦикла; 
    
    КлючевыеСтавки.Сортировать("Период");
    
    Возврат КлючевыеСтавки;
    
КонецФункции

Процедура АУ_ЗагрузкаСтавкиРефинансирования() Экспорт
	
	ТаблицаСтавок = ПолучитьКлючевыеСтавки(ТекущаяДата(), ТекущаяДата() - 86400 * 3);
	
	Для каждого стрСтавка Из ТаблицаСтавок Цикл
		
		рег = РегистрыСведений.АУ_СтавкиРефинансированияЦБ.СоздатьМенеджерЗаписи();
		рег.Период = стрСтавка.Период;
		рег.Ставка = стрСтавка.Значение;
		рег.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АУ_УведомленияОСрокеВыполненияКонтракта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.АУ_КрайняяДатаПоставки КАК АУ_КрайняяДатаПоставки,
	|	ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта КАК АУ_ПеренесенныйСрокИсполненияКонтракта,
	|	ЗаказКлиента.Договор.Номер КАК ДоговорНомер
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО СостоянияЗаказовКлиентов.Заказ = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.Задание КАК Задание
	|		ПО (ЗаказКлиента.Ссылка = Задание.Предмет)
	|			И (Задание.АУ_ВидЗадания = ЗНАЧЕНИЕ(Перечисление.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЗаказКлиента.АУ_ПеренесенныйСрокИсполненияКонтракта = &АУ_ПеренесенныйСрокИсполненияКонтракта
	|			КОГДА НЕ ЗаказКлиента.АУ_КрайняяДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЗаказКлиента.АУ_КрайняяДатаПоставки = &АУ_КрайняяДатаПоставки
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ СостоянияЗаказовКлиентов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию))
	|	И ЕСТЬNULL(Задание.Завершен, ИСТИНА) = ИСТИНА
	|	И НЕ ЗаказКлиента.АУ_НеФормироватьЗапросОСрокахИсполненияЗаказа
	|	И НЕ СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100";
	
	Запрос.УстановитьПараметр("АУ_КрайняяДатаПоставки", НачалоДня(ТекущаяДатаСеанса() + 86400 * 15));
	Запрос.УстановитьПараметр("АУ_ПеренесенныйСрокИсполненияКонтракта", НачалоДня(ТекущаяДатаСеанса() + 86400 * 13));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Задание = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
		Задание.Дата = ТекущаяДатаСеанса();
		Задание.Автор = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ПользовательУведомленияОПереносеСроковИсполненияКонтракта");
		Задание.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		Задание.Исполнитель = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("РуководительОтделаЗакупок");
		Задание.Предмет = Выборка.Ссылка;
		Задание.Наименование = СтрШаблон("Обеспечение. Уточнение даты поставки товара, дата исполнения ГК №%1 Заказ клиента %2", Выборка.ДоговорНомер, Выборка.Ссылка);
		Задание.Проверяющий = Задание.Автор;
		Задание.Содержание = "Необходимо уточнить срок исполнения контракта и отметить в задаче";
		Задание.АУ_ВидЗадания = Перечисления.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта;
		
		Если ЗначениеЗаполнено(Выборка.АУ_ПеренесенныйСрокИсполненияКонтракта) Тогда
			Задание.СрокИсполнения = ДобавитьКДатеРабочиеДни(Задание.Дата, 3);
		Иначе
			Задание.СрокИсполнения = ДобавитьКДатеРабочиеДни(Задание.Дата, 2);
		КонецЕсли;
		
		Задание.Записать();
		Задание.Старт();
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиЧислаВСтроке(Строка) Экспорт

   МассивЧисел = Новый Массив;

   СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1);

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(СтрокаЧисел);
         СтрокаЧисел = "";
      КонецЕсли;
   
  КонецЦикла;
  
   Если СтрДлина(СтрокаЧисел)>0 Тогда
       МассивЧисел.Добавить(СтрокаЧисел);
   КонецЕсли;
   
   Возврат МассивЧисел;

КонецФункции

Функция СоздатьСтруктуруПоРегиструСведений(ИмяРегистраСведений) Экспорт
	
    // Получаем описание регистра сведений из метаданных
    РегистрСведений = Метаданные.РегистрыСведений[ИмяРегистраСведений];
    
    // Проверяем, существует ли указанный регистр сведений
    Если РегистрСведений = Неопределено Тогда
        ВызватьИсключение "Регистр сведений '" + ИмяРегистраСведений + "' не найден!";
    КонецЕсли;
    
    // Создаем новую структуру
    НоваяСтруктура = Новый Структура;
    
    // Добавляем измерения
    Для Каждого Измерение Из РегистрСведений.Измерения Цикл
        НоваяСтруктура.Вставить(Измерение.Имя, Неопределено);
    КонецЦикла;
    
    // Добавляем ресурсы
    Для Каждого Ресурс Из РегистрСведений.Ресурсы Цикл
        НоваяСтруктура.Вставить(Ресурс.Имя, Неопределено);
    КонецЦикла;
    
    // Возвращаем созданную структуру
    Возврат НоваяСтруктура;
	
КонецФункции

Функция ПолучитьАдресаПочтыПользователей(мПользователи, АдресаДляОтправкиСтрокой = "") Экспорт
	
	МассивАдресов = Новый Массив;
	
	ОтборПользователей = Новый Массив;
	Если ТипЗнч(мПользователи) = Тип("Массив") Тогда
		ОтборПользователей  = мПользователи;
	ИначеЕсли ТипЗнч(мПользователи) = Тип("СправочникСсылка.Пользователи") Тогда
		ОтборПользователей.Добавить(мПользователи);
	Иначе
		Возврат МассивАдресов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Ссылка В(&Пользователи)
	|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ПользователиКонтактнаяИнформация.АдресЭП <> """"";
	
	Запрос.УстановитьПараметр("Пользователи", ОтборПользователей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивАдресов.Добавить(Новый Структура("Адрес,Представление", Выборка.АдресЭП, Выборка.Ссылка));
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Выборка.АдресЭП;
		
	КонецЦикла;
		
	Возврат МассивАдресов;

КонецФункции

Процедура ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(Форма, ИмяРеквизита = "ТоварыНоменклатура") Экспорт
	
	МассивПараметров = Новый Массив;
	Для каждого стрПараметр Из Форма.Элементы[ИмяРеквизита].ПараметрыВыбора Цикл
		МассивПараметров.Добавить(стрПараметр);
	КонецЦикла;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.АУ_ВАрхиве", Ложь));
	
	Форма.Элементы[ИмяРеквизита].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры


#Область ПрограммныйИнтерфейс

// Возвращает граничную дату: если срок годности серии меньше этой даты, до истечения осталось менее 1 года от даты документа.
//
// Параметры:
//  ОбъектДокумента - документ
//
// Возвращаемое значение:
//  Дата - дата документа + 12 месяцев.
//
Функция ГраничнаяДатаСрокаГодностиСерий(ЗНАЧ ОбъектДокумента) Экспорт
	
	ДатаДокумента = ОбъектДокумента.Дата;
	КоличествоМесяцев = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("КоличествоМесяцевДоИстеченияСрокаГодностиСерий");
	
	Если ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Распоряжение = ОбъектДокумента.Распоряжение;
	ИначеЕсли ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		
		Для каждого стрТовары Из ОбъектДокумента.ТоварыПоРаспоряжениям Цикл
			Если ЗначениеЗаполнено(стрТовары.Распоряжение) Тогда
				Распоряжение = стрТовары.Распоряжение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжение) И НЕ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Распоряжение.Контрагент);
		Массив.Добавить(Распоряжение.Партнер);
		
		ЗначенияРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Массив, "АУ_КоличествоМесяцевДоИстеченияСрокаГодностиСерий");
		
		Если ЗначенияРеквизита[Распоряжение.Контрагент] <> 0 Тогда
			КоличествоМесяцев = ЗначенияРеквизита[Распоряжение.Контрагент];
		ИначеЕсли ЗначенияРеквизита[Распоряжение.Партнер] <> 0 Тогда
			КоличествоМесяцев = ЗначенияРеквизита[Распоряжение.Партнер];
		КонецЕсли;
		
	КонецЕсли;
	
	Если КоличествоМесяцев = 0 Тогда
		КоличествоМесяцев = 12;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ДобавитьМесяц(НачалоДня(ДатаДокумента), КоличествоМесяцев);
	
КонецФункции

// Проверяет наличие серий с заполненным сроком годности менее 1 года от даты документа.
//
// Параметры:
//  ДатаДокумента - Дата - дата документа.
//  ОбъектДокумента - ДокументОбъект - объект документа.
//  ИменаТабличныхЧастей - Массив из Строка - имена табличных частей с реквизитом Серия.
//
// Возвращаемое значение:
//  Булево - Истина, если найдена хотя бы одна подходящая серия.
//
Функция ЕстьСерииСИстекающимСрокомГодности(ДатаДокумента, ОбъектДокумента, ИменаТабличныхЧастей) Экспорт
	
	Серии = Новый Массив;
	УникальныеСерии = Новый Соответствие;
	
	Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
		
		ТабличнаяЧасть = ОбъектДокумента[ИмяТабличнойЧасти];
		
		Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Серия) Тогда
				Продолжить;
			КонецЕсли;
			
			Если УникальныеСерии[СтрокаТабличнойЧасти.Серия] = Неопределено Тогда
				УникальныеСерии.Вставить(СтрокаТабличнойЧасти.Серия, Истина);
				Серии.Добавить(СтрокаТабличнойЧасти.Серия);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Серии.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГраничнаяДата = ГраничнаяДатаСрокаГодностиСерий(ОбъектДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК Серии
	|ГДЕ
	|	Серии.Ссылка В(&Серии)
	|	И Серии.ГоденДо <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Серии.ГоденДо < &ГраничнаяДата";
	
	Запрос.УстановитьПараметр("Серии", Серии);
	Запрос.УстановитьПараметр("ГраничнаяДата", ГраничнаяДата);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Добавляет условное оформление строк таблицы: красный шрифт для серий с истекающим сроком годности.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//  ИмяЭлементаТаблицы - Строка - имя элемента таблицы на форме (например, "Товары").
//  ПутьКПолюСерии - Строка - путь к реквизиту Серия в данных строки (например, "Объект.Товары.Серия").
//  ИмяРеквизитаГраничнойДаты - Строка - имя реквизита формы с граничной датой.
//
Процедура УстановитьУсловноеОформлениеИстекающихСерий(Форма, ИмяЭлементаТаблицы, ПутьКПолюСерии, ИмяРеквизитаГраничнойДаты, МассивРеквизитовПосветки) Экспорт
	
	ПутьГоденДо = ПутьКПолюСерии + ".АУ_СрокГодности";
	
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();
	
	Для каждого Имя Из МассивРеквизитовПосветки Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Имя);
	КонецЦикла;
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюСерии);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьГоденДо);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьГоденДо);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ИмяРеквизитаГраничнойДаты);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

// Создаёт служебные реквизиты формы для проверки и условного оформления.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ПодготовитьРеквизитыФормыДляИстекающихСерий(Форма) Экспорт
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(Форма, "АУ_ГраничнаяДатаСрокаГодностиСерий", Новый ОписаниеТипов("Дата"));
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("АУ_СрокГодности", АУ_СозданиеЭлементовФормы.ОписаниеТипаДатаВремя("Дата"));
	
	Если Форма.Элементы.Найти("Товары") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.Товары", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.Товары);
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ТоварыПоРаспоряжениям") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.ТоварыПоРаспоряжениям", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.ТоварыПоРаспоряжениям);
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ОтгружаемыеТовары") <> Неопределено Тогда
		АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "Объект.ОтгружаемыеТовары", Реквизиты);
		ЗаполнитьСрокГодностиТабличнойЧастиТовары(Форма.Объект.ОтгружаемыеТовары);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет граничную дату на форме по дате документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ОбновитьГраничнуюДатуНаФормеДляИстекающихСерий(Форма) Экспорт
	
	Форма.АУ_ГраничнаяДатаСрокаГодностиСерий = ГраничнаяДатаСрокаГодностиСерий(Форма.Объект);
	
КонецПроцедуры

// Заполняет реквизит АУ_СрокГодности в строке табличной части Товары по серии номенклатуры.
//
// Параметры:
//  СтрокаТовары - СтрокаТабличнойЧасти - строка табличной части Товары документа ПриходныйОрдерНаТовары.
//
Процедура ЗаполнитьСрокГодностиВСтрокеТовары(СтрокаТовары) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
		СтрокаТовары.АУ_СрокГодности = Дата(1, 1, 1);
		Возврат;
	КонецЕсли;
	
	СтрокаТовары.АУ_СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Серия, "ГоденДо");
	
КонецПроцедуры

// Заполняет реквизит АУ_СрокГодности во всех строках табличной части Товары по сериям номенклатуры.
//
// Параметры:
//  ТабличнаяЧастьТовары - ТабличнаяЧасть - табличная часть Товары документа ПриходныйОрдерНаТовары.
//
Процедура ЗаполнитьСрокГодностиТабличнойЧастиТовары(ТабличнаяЧастьТовары) Экспорт
	
	Серии = Новый Массив;
	УникальныеСерии = Новый Соответствие;
	
	Для Каждого СтрокаТовары Из ТабличнаяЧастьТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
			Продолжить;
		КонецЕсли;
		
		Если УникальныеСерии[СтрокаТовары.Серия] = Неопределено Тогда
			УникальныеСерии.Вставить(СтрокаТовары.Серия, Истина);
			Серии.Добавить(СтрокаТовары.Серия);
		КонецЕсли;
		
	КонецЦикла;
	
	СрокиГодностиПоСериям = Новый Соответствие;
	
	Если Серии.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Серии.Ссылка КАК Серия,
		|	Серии.ГоденДо КАК ГоденДо
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК Серии
		|ГДЕ
		|	Серии.Ссылка В(&Серии)";
		
		Запрос.УстановитьПараметр("Серии", Серии);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СрокиГодностиПоСериям.Вставить(Выборка.Серия, Выборка.ГоденДо);
		КонецЦикла;
		
	КонецЕсли;
	
	ПустаяДата = Дата(1, 1, 1);
	
	Для Каждого СтрокаТовары Из ТабличнаяЧастьТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
			СтрокаТовары.АУ_СрокГодности = ПустаяДата;
			Продолжить;
		КонецЕсли;
		
		СрокГодности = СрокиГодностиПоСериям[СтрокаТовары.Серия];
		Если СрокГодности = Неопределено Тогда
			СтрокаТовары.АУ_СрокГодности = ПустаяДата;
		Иначе
			СтрокаТовары.АУ_СрокГодности = СрокГодности;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
